OpenNuvoton/NUC970_NonOS_BSP/Library/USB_HOST/src_core/config.c
/**************************************************************************//**
 * @file     config.c
 * @version  V1.10
 * $Revision: 2 $
 * $Date: 15/05/18 3:55p $
 * @brief  This file manages USB configuration descriptor.
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "nuc970.h"
#include "sys.h"

#include "usb.h"

/// @cond HIDDEN_SYMBOLS

#define USB_MAXALTSETTING		128	/* Hard limit */
#define USB_MAXENDPOINTS		30	/* Hard limit */

#define USB_MAXCONFIG			8	/* Arbitrary limit */


#ifdef DEBUG
static inline const char *plural(int n)
{
	return (n == 1 ? "" : "s");
}
#endif


#ifdef DUMP_DESCRIPTOR
static void  dump_config_descriptor(struct usb_config_descriptor *desc)
{
    uint8_t   *bptr = (uint8_t *)desc;
    int       tlen = desc->wTotalLength;
    struct usb_interface_descriptor  *if_desc;
    struct usb_endpoint_descriptor  *ep_desc;

    while (tlen > 0) {
        switch (bptr[1]) {
        case USB_DT_CONFIG:
            sysprintf("\n[Configuration Descriptor]\n");
            sysprintf("----------------------------------------------\n");
            sysprintf("  Length              = %2d\n",  desc->bLength);
            sysprintf("  DescriptorType      = %02x\n", desc->bDescriptorType);
            sysprintf("  wTotalLength        = %2d\n", desc->wTotalLength);
            sysprintf("  bNumInterfaces      = %d\n", desc->bNumInterfaces);
            sysprintf("  bConfigurationValue = %d\n", desc->bConfigurationValue);
            sysprintf("  iConfiguration      = %d\n", desc->iConfiguration);
            sysprintf("  bmAttributes        = 0x%02x\n", desc->bmAttributes);
            sysprintf("  MaxPower            = %d\n", desc->bMaxPower);
            break;

        case USB_DT_INTERFACE:
            if_desc = (struct usb_interface_descriptor *)bptr;
            sysprintf("\n[Interface Descriptor]\n");
            sysprintf("----------------------------------------------\n");
            sysprintf("  Length              = %2d\n",  if_desc->bLength);
            sysprintf("  DescriptorType      = %02x\n", if_desc->bDescriptorType);
            sysprintf("  bInterfaceNumber    = %d\n", if_desc->bInterfaceNumber);
            sysprintf("  bAlternateSetting   = %d\n", if_desc->bAlternateSetting);
            sysprintf("  bNumEndpoints       = %d\n", if_desc->bNumEndpoints);
            sysprintf("  bInterfaceClass     = 0x%02x\n", if_desc->bInterfaceClass);
            sysprintf("  bInterfaceSubClass  = 0x%02x\n", if_desc->bInterfaceSubClass);
            sysprintf("  bInterfaceProtocol  = 0x%02x\n", if_desc->bInterfaceProtocol);
            sysprintf("  iInterface          = %d\n", if_desc->iInterface);
            break;

        case USB_DT_ENDPOINT:
            ep_desc = (struct usb_endpoint_descriptor *)bptr;
            sysprintf("\n[Endoint Descriptor]\n");
            sysprintf("----------------------------------------------\n");
            sysprintf("  Length              = %2d\n",  ep_desc->bLength);
            sysprintf("  DescriptorType      = %02x\n", ep_desc->bDescriptorType);
            sysprintf("  bEndpointAddress    = 0x%02x\n", ep_desc->bEndpointAddress);
            sysprintf("  bmAttributes        = 0x%02x\n", ep_desc->bmAttributes);
            sysprintf("  wMaxPacketSize      = %d\n", ep_desc->wMaxPacketSize);
            sysprintf("  bInterval           = %d\n", ep_desc->bInterval);
            sysprintf("  bRefresh            = %d\n", ep_desc->bRefresh);
            sysprintf("  bSynchAddress       = %d\n", ep_desc->bSynchAddress);
            break;
        }
        if (bptr[0] == 0)
            break;
        tlen -= bptr[0];
        bptr += bptr[0];
    }
}
#endif


static int find_next_descriptor(unsigned char *buffer, int size,
    int dt1, int dt2, int *num_skipped)
{
	struct usb_descriptor_header *h;
	int n = 0;
	unsigned char *buffer0 = buffer;

	/* Find the next descriptor of type dt1 or dt2 */
	while (size > 0) {
		h = (struct usb_descriptor_header *) buffer;
		if (h->bDescriptorType == dt1 || h->bDescriptorType == dt2)
			break;
		buffer += h->bLength;
		size -= h->bLength;
		++n;
	}

	/* Store the number of descriptors skipped and return the
	 * number of bytes skipped */
	if (num_skipped)
		*num_skipped = n;
	return buffer - buffer0;
}

static void usb_parse_ss_endpoint_companion(struct device *ddev, int cfgno,
		int inum, int asnum, struct usb_host_endpoint *ep,
		unsigned char *buffer, int size)
{
	struct usb_ss_ep_comp_descriptor *desc;
	int max_tx;

	/* The SuperSpeed endpoint companion descriptor is supposed to
	 * be the first thing immediately following the endpoint descriptor.
	 */
	desc = (struct usb_ss_ep_comp_descriptor *) buffer;
	if (desc->bDescriptorType != USB_DT_SS_ENDPOINT_COMP ||
			size < USB_DT_SS_EP_COMP_SIZE) {
		USB_debug("No SuperSpeed endpoint companion for config %d "
				" interface %d altsetting %d ep %d: "
				"using minimum values\n",
				cfgno, inum, asnum, ep->desc.bEndpointAddress);

		/* Fill in some default values.
		 * Leave bmAttributes as zero, which will mean no streams for
		 * bulk, and isoc won't support multiple bursts of packets.
		 * With bursts of only one packet, and a Mult of 1, the max
		 * amount of data moved per endpoint service interval is one
		 * packet.
		 */
		ep->ss_ep_comp.bLength = USB_DT_SS_EP_COMP_SIZE;
		ep->ss_ep_comp.bDescriptorType = USB_DT_SS_ENDPOINT_COMP;
		if (usb_endpoint_xfer_isoc(&ep->desc) ||
				usb_endpoint_xfer_int(&ep->desc))
			ep->ss_ep_comp.wBytesPerInterval =
					ep->desc.wMaxPacketSize;
		return;
	}

	memcpy(&ep->ss_ep_comp, desc, USB_DT_SS_EP_COMP_SIZE);

	/* Check the various values */
	if (usb_endpoint_xfer_control(&ep->desc) && desc->bMaxBurst != 0) {
		USB_debug("Control endpoint with bMaxBurst = %d in "
				"config %d interface %d altsetting %d ep %d: "
				"setting to zero\n", desc->bMaxBurst,
				cfgno, inum, asnum, ep->desc.bEndpointAddress);
		ep->ss_ep_comp.bMaxBurst = 0;
	} else if (desc->bMaxBurst > 15) {
		USB_debug("Endpoint with bMaxBurst = %d in "
				"config %d interface %d altsetting %d ep %d: "
				"setting to 15\n", desc->bMaxBurst,
				cfgno, inum, asnum, ep->desc.bEndpointAddress);
		ep->ss_ep_comp.bMaxBurst = 15;
	}

	if ((usb_endpoint_xfer_control(&ep->desc) ||
			usb_endpoint_xfer_int(&ep->desc)) &&
				desc->bmAttributes != 0) {
		USB_debug("%s endpoint with bmAttributes = %d in "
				"config %d interface %d altsetting %d ep %d: "
				"setting to zero\n",
				usb_endpoint_xfer_control(&ep->desc) ? "Control" : "Bulk",
				desc->bmAttributes,
				cfgno, inum, asnum, ep->desc.bEndpointAddress);
		ep->ss_ep_comp.bmAttributes = 0;
	} else if (usb_endpoint_xfer_bulk(&ep->desc) &&
			desc->bmAttributes > 16) {
		USB_debug("Bulk endpoint with more than 65536 streams in "
				"config %d interface %d altsetting %d ep %d: "
				"setting to max\n",
				cfgno, inum, asnum, ep->desc.bEndpointAddress);
		ep->ss_ep_comp.bmAttributes = 16;
	} else if (usb_endpoint_xfer_isoc(&ep->desc) &&
			desc->bmAttributes > 2) {
		USB_debug("Isoc endpoint has Mult of %d in "
				"config %d interface %d altsetting %d ep %d: "
				"setting to 3\n", desc->bmAttributes + 1,
				cfgno, inum, asnum, ep->desc.bEndpointAddress);
		ep->ss_ep_comp.bmAttributes = 2;
	}

